src/Documents/ИТ_КорректировкаПланаПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИТ_КорректировкаПланаПродаж</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИТ_ПланПродаж_Корректировка</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПлана</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИТ_СтатусыПлановПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_7</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_8</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_9</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_10</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_11</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_12</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_13</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_14</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_15</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_16</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_17</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_18</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_19</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_20</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_21</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_22</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_23</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_24</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_25</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_26</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_27</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_28</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_29</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_30</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДень_31</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_4</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_5</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_6</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_7</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_8</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_9</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_10</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_11</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_12</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_13</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_14</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_15</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_16</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_17</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_18</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_19</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_20</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_21</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_22</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_23</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_24</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_25</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_26</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_27</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_28</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_29</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_30</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьДень_31</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ИТ_КорректировкаПланаПродаж/Ext/ObjectModule.bsl
#Область ОбработкаСобытийОбъекта

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(ПериодПлана) Тогда 
		
		Если ПериодПлана <> НачалоМесяца(ПериодПлана) Тогда 
			ПериодПлана = НачалоМесяца(ПериодПлана); 
		КонецЕсли;
		
		ПериодПлана_Представление = Формат(ПериодПлана, "ДФ='ММММ гггг ''г.'''"); 
		
		// Ввод корректировки осуществляется только после полного согласования плана продаж.
		Запрос = Новый Запрос();
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИТ_УстановкаПланаПродаж_Месяц.Ссылка
			|ИЗ
			|	Документ.ИТ_УстановкаПланаПродаж_Месяц КАК ИТ_УстановкаПланаПродаж_Месяц
			|ГДЕ
			|	ИТ_УстановкаПланаПродаж_Месяц.ПериодПлана = &ПериодПлана
			|	И ИТ_УстановкаПланаПродаж_Месяц.Статус = ЗНАЧЕНИЕ(Перечисление.ИТ_СтатусыПлановПродаж.Согласован)
			|	И ИТ_УстановкаПланаПродаж_Месяц.Проведен";
		Запрос.УстановитьПараметр("ПериодПлана", ПериодПлана);
		
		РезультатЗапроса = Запрос.Выполнить();
			
		Если РезультатЗапроса.Пустой() Тогда 
			ТекстСообщения = СтрШаблон("На период %1 еще не согласован план продаж. Ввод корректировки на данный период недопустим.", ПериодПлана_Представление);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка, "Объект", "Объект", Отказ);
		КонецЕсли;
		
		// Ввод корректировки осуществляется по торговой точке 
		// и допустимо введение одного документа на месяц на каждую торговую точку.
		Если ЗначениеЗаполнено(ТорговаяТочка) Тогда 
			Запрос = Новый Запрос();
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ИТ_КорректировкаПланаПродаж.Ссылка
				|ИЗ
				|	Документ.ИТ_КорректировкаПланаПродаж КАК ИТ_КорректировкаПланаПродаж
				|ГДЕ
				|	ИТ_КорректировкаПланаПродаж.Проведен
				|	И ИТ_КорректировкаПланаПродаж.Ссылка <> &ЭтотДокумент
				|	И ИТ_КорректировкаПланаПродаж.ТорговаяТочка = &ТорговаяТочка
				|	И ИТ_КорректировкаПланаПродаж.ПериодПлана = &ПериодПлана";
			
			Запрос.УстановитьПараметр("ЭтотДокумент",	Ссылка);
			Запрос.УстановитьПараметр("ТорговаяТочка",	ТорговаяТочка);
			Запрос.УстановитьПараметр("ПериодПлана",	ПериодПлана);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если Не(РезультатЗапроса.Пустой()) Тогда 
				ТекстСообщения = СтрШаблон("По торговой точке %1 уже есть документы за %2", Строка(ТорговаяТочка), ПериодПлана_Представление);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка, "Объект", "Объект", Отказ);
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не(ЗначениеЗаполнено(Статус)) Тогда 
		Статус = Перечисления.ИТ_СтатусыПлановПродаж.НаПодготовке;
	КонецЕсли;	
	
	Ответственный	= ПараметрыСеанса.ТекущийПользователь;
	КоличествоДней	= День(КонецМесяца(ПериодПлана));
	СуммаДокумента	= 0;
	   
	Для НомерДня = 1 По 31 Цикл 
		НомерДня_Строка		= ПолучитьЧислоСтрокой(НомерДня);
		КлючПоляСуммы		= ПолучитьКлючСуммы(НомерДня_Строка);	
		КлючПоляОбнуления	= ПолучитьКлючОбнуления(НомерДня_Строка);
		
		Если НомерДня > КоличествоДней Тогда  // Обнуление дней не входящих в период 
			ЭтотОбъект[КлючПоляСуммы]		= 0;
			ЭтотОбъект[КлючПоляОбнуления]	= Ложь;
		Иначе
			СуммаДокумента	= СуммаДокумента + ЭтотОбъект[КлючПоляСуммы]; 	
		КонецЕсли;	
	КонецЦикла;
	
	ДополнительныеСвойства.Вставить("ИТ_УведомитьПоПочте", ЭтоНовый());
			
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	УведомитьПоПочте = ИТ_ОбработкаДанных.ПолучитьСвойствоСтруктуры(ДополнительныеСвойства, "ИТ_УведомитьПоПочте", Тип("Булево"), Ложь);
	
	Если УведомитьПоПочте Тогда                
		Попытка
			ШаблонПисьма = 
				"<p>Добрый день!</p>
				|		<p>В программе 1С:Розница сформирована корректировка плана продаж.</p>
				|		<br>
				|		<table border=""0"">
				|			<tbody>
				|				<tr>
				|					<td>Номер документа</td>
				|					<td>%1</td>
				|				</tr>
				|				<tr>
				|					<td>Месяц</td>
				|					<td>%2</td>
				|				</tr>
				|				<tr>
				|					<td>Торговая точка</td>
				|					<td>%3</td>
				|				</tr>
				|				<tr>
				|					<td>Ответственный</td>
				|					<td>%4</td>
				|				</tr>
				|				<tr>
				|					<td>Сумма документа</td>
				|					<td>%5</td>
				|				</tr>
				|			</tbody>
				|		</table>
				|		<p>&nbsp;</p>";

			ТелоПисьма = ИТ_СпециальныйМодульСервер.СформироватьHTML("",
							СтрШаблон(
								ШаблонПисьма,
								Строка(Номер),
								Формат(ПериодПлана, "ДФ='ММММ гггг ''г.'''"),
								Строка(ТорговаяТочка),
								Строка(Ответственный),
								СтрШаблон("%1 ₽", Формат(СуммаДокумента, "ЧДЦ=2; ЧН=0,00; ЧГ=3,0"))));
							
			ФизЛица_Получатели	= USAC_ПолучениеДанныхСерверПривилегированный.ПолучитьМассивОбъектовПоКлючамИдентификаторов("ПолучателиУведомленийКорректировкиПланаПродаж", Истина);				
			АдресатыПисьма		= ИТ_СпециальныйМодульСервер.ПолучитьАдресатовПоФизЛицам(ФизЛица_Получатели);
			ПараметрыПочты		= ИТ_СпециальныйМодульСервер.ПолучитьПараметрыПочты(Истина, Ложь);
			ПараметрыПисьма		= ИТ_СпециальныйМодульСервер.ПолучитьПараметрыПисьма(АдресатыПисьма, "Создание корректировки плана продаж", ТелоПисьма,, Перечисления.ТипыТекстовЭлектронныхПисем.HTML); 
			ИТ_СпециальныйМодульСервер.ОтправитьПисьмо(ПараметрыПочты, ПараметрыПисьма, Истина);
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации(
				"Уведомление о создании корректировки плана продаж", 
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Документы.ИТ_КорректировкаПланаПродаж,
				Ссылка,
				ТекстОшибки);
		КонецПопытки;	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Статус = Перечисления.ИТ_СтатусыПлановПродаж.Согласован Тогда 
		Движения.ИТ_ПланПродаж_Корректировка.Записывать = Истина;
		
		ГодПлана		= Год(ПериодПлана);
		МесяцПлана		= Месяц(ПериодПлана);
		КоличествоДней	= День(КонецМесяца(ПериодПлана));
		
		Для НомерДня = 1 По КоличествоДней Цикл 
			НомерДня_Строка		= ПолучитьЧислоСтрокой(НомерДня);
			КлючПоляСуммы		= ПолучитьКлючСуммы(НомерДня_Строка);	
			КлючПоляОбнуления	= ПолучитьКлючОбнуления(НомерДня_Строка);
			СуммаДня			= ЭтотОбъект[КлючПоляСуммы]; 
			ОбнулитьДень		= ЭтотОбъект[КлючПоляОбнуления]; 
			
			Если СуммаДня > 0 
				Или ОбнулитьДень Тогда 
				Движение				= Движения.ИТ_ПланПродаж_Корректировка.Добавить();
				Движение.Период			= Дата(ГодПлана, МесяцПлана, НомерДня);
				Движение.ТорговаяТочка	= ТорговаяТочка;
				
				Если ОбнулитьДень Тогда 
					Движение.Сумма = 0;	
				Иначе
					Движение.Сумма = СуммаДня;	
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
	ИТ_ПланыПродаж.РассчитатьКоличествоКгНабораЗаписей(Движения.ИТ_ПланПродаж_Корректировка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьЧислоСтрокой(Число)
	
	Возврат Формат(Число, "ЧДЦ=0; ЧН=0; ЧГ=0");	
	
КонецФункции

Функция ПолучитьКлючСуммы(НомерДня_Строка)
	
	Возврат СтрШаблон("СуммаДень_%1", НомерДня_Строка);
	
КонецФункции

Функция ПолучитьКлючОбнуления(НомерДня_Строка)
	
	Возврат СтрШаблон("ОбнулитьДень_%1", НомерДня_Строка);
	
КонецФункции	

#КонецОбласти
